# Set global configuration arguments
cask_args appdir: "/Applications"

# System set up
brew "bat"
brew "colordiff"
brew "coreutils"  # Those that come with macOS are outdated
brew "curl"
brew "git"
brew "grep"
brew "mas"
brew "rsync"
brew "wget"
brew "libpq"
brew "graphviz"

# Docker / Kubernetes
brew "kubectl"
brew "docker-Buildx"
brew "helm"


# Cloud CLI tools
brew "azure-cli"
brew "argocd"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-jetbrains-mono"

# Programming languages / Development
brew "mysql"
brew "node"
brew "pyenv"
brew "yarn"
brew "nvm"
brew "pipenv"
brew "rustup-init"
brew "openjdk@21"

# Code formatters
brew "black"

# Code linters
brew "pylint"

# Shell
cask "iterm2"
brew "fzf"
brew "luajit", args: ['HEAD']
brew "luarocks"
brew "ripgrep"
brew "zsh"

# Install applications
cask "rectangle"
cask "visual-studio-code"
cask "obsidian"
cask "postico"
