# Set global configuration arguments
cask_args appdir: "/Applications"

# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"

# System set up
brew "bat"
brew "colordiff"
brew "coreutils"  # Those that come with macOS are outdated
brew "curl"
brew "git"
brew "grep"
brew "mas"
brew "rsync"
brew "wget"
brew "libpq"

# Docker / Kubernetes
brew "kubectl"
brew "docker-Buildx"

# Cloud CLI tools
brew "azure-cli"
brew "argocd"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-jetbrains-mono"

# Programming languages / Development
brew "mysql"
brew "node"
brew "pyenv"
brew "yarn"
brew "nvm"
brew "pipenv"
brew "rustup-init"

# Code formatters
brew "black"

# Code linters
brew "pylint"

# Shell
cask "iterm2"
brew "fzf"
brew "luajit", args: ['HEAD']
brew "luarocks"
brew "neovim", args: ['HEAD']
brew "ripgrep"
brew "thefuck"
brew "tmux"
brew "zsh"

# Install applications
cask "google-chrome"
cask "notion"
cask "rectangle"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zed"
cask "zoom"
cask "obsidian"
cask "postico"
cask "insomnia"
